In [9]:
import pandas as pd
import numpy as np
exam1 = [89,85,93,83]
labels  = ['Student A', 'Student B', 'Student C', 'Student D']

pd.Series(exam1,labels)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [10]:
pd.Series(exam1,labels)['Student D']

83

In [11]:
d = {s:p for s,p in zip(labels,exam1)}
d

{'Student A': 89, 'Student B': 85, 'Student C': 93, 'Student D': 83}

In [12]:
pd.Series(d)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [13]:
exam2 = [74,56,44,92]

e1 = pd.Series(exam1,labels)
e2 = pd.Series(exam2,labels)

In [14]:
df = pd.DataFrame({'e1':exam1, 'e2':exam2},index=labels)
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [15]:
data = np.array([exam1,exam2])
data.transpose()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [16]:
df = pd.DataFrame(data.transpose(),index=labels,columns=['e1','e2'])
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [17]:
df.shape

(4, 2)

In [18]:
df['e3'] = [67,59,79,84]
df

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [19]:
df['semester1'] = df['e1'] + df['e2'] + df['e3']
df

           e1  e2  e3  semester1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [20]:
df[['e1','e2']]

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [21]:
df.loc['Student C']

e1            93
e2            44
e3            79
semester1    216
Name: Student C, dtype: int64

In [22]:
df.loc['Student C','e2']

44

In [23]:
df.loc[['Student C','Student D'],['e2']]

           e2
Student C  44
Student D  92

In [24]:
df.loc[['Student C'],['e2']]

           e2
Student C  44

In [25]:
df.iloc[1]

e1            85
e2            56
e3            59
semester1    200
Name: Student B, dtype: int64

In [26]:
df.iloc[1:,1]

Student B    56
Student C    44
Student D    92
Name: e2, dtype: int32